
[
  {
    "company": "Optimizely, Dhaka",
    "roles": [
      {
        "position": "Software Engineer I",
        "duration": "Mar, 2024 - Present",
        "details": [
          {
            "title": "Axiom - Open Source Design System",
            "link": "https://optimizely-axiom.github.io/optiaxiom/",
            "points": [
              "Contributed to the development of Axiom v2, a modular and accessible React-based design system for Optimizely, by building and refining reusable components and layout utilities.",
              "Supported the migration of internal design systems in Optimizely's Content Marketing Platform (CMP) to Axiom v2, replacing legacy UI implementations with standardized Axiom components.",
              "Assisted in the version upgrade from Axiom v1 to v2 for products already using Axiom, enabling adoption of modernized design tokens, accessibility improvements, and new component APIs.",
              "Participated in manual migration planning for products not previously using Axiom, involving assessment of legacy UI patterns and strategizing future component replacement workflows.",
              "Helped identify and resolve UI issues within CMP during integration efforts, contributing to more stable and consistent visual experiences across products.",
              "Collaborated on internal documentation and developer guidance to promote smoother adoption of Axiom across cross-functional teams."
            ]
          },
          {
            "title": "Content Marketing Platform - Enterprise SaaS tool",
            "link": "https://www.optimizely.com/products/content-marketing/",
            "points": [
              "Built features and reviewed TypeScript code for CMP which is used by companies such as Shell and Xerox."
            ]
          }
        ]
      }
    ]
  },
  {
    "company": "Orion Informatics Ltd, Dhaka",
    "roles": [
      {
        "position": "Software Engineer",
        "duration": "Oct, 2023 - Jan 2024",
        "details": [
          {
            "title": "Attendance Management System",
            "points": [
              "Developed dynamic and interactive dashboards using Chart.js, implementing custom graphs and filters to improve data analysis and administrative reporting efficiency."
            ]
          },
          {
            "title": "Automated Trading System",
            "points": [
              "Designed and implemented a RESTful API in ASP.NET Core to connect TradeStation webhooks with execution logic, enabling real-time stock trade automation.",
              "Deployed the service to Microsoft Azure using App Services and conducted end-to-end API testing with Postman; integrated secure FTP server monitoring using FileZilla."
            ]
          },
          {
            "title": "Bangladesh University Admin Dashboard",
            "points": [
              "Developed interactive data visualizations using Chart.js within an ASP.NET MVC framework to help stakeholders analyze academic metrics effectively."
            ]
          }
        ]
      },
      {
        "position": "Junior Software Engineer",
        "duration": "Jul, 2023 - Sep 2023",
        "details": [
          {
            "title": "Remote Patient Management System",
            "points": [
              "Built a cost-effective prototype for a non-invasive glucometer using Arduino and infrared sensors, programmed with Arduino IDE to measure glucose levels in real-time."
            ]
          },
          {
            "title": "SME Client Website (Frontend)",
            "points": [
              "Collaborated with the frontend team to implement UI changes and client-requested design updates using HTML, CSS, and jQuery, improving overall user experience."
            ]
          },
          {
            "title": "AI ECG Dataset preparation",
            "points": [
              "Processed and cleaned ECG datasets using Python for machine learning model preparation.",
              "Automated file organization, renaming, and validation tasks using console scripting to ensure data consistency and quality."
            ]
          }
        ]
      }
    ]
  }
]
